#include "CharData.h"

std::string _skName[10][3] =
{
         {"ñÏèbÇÃä·åı","Ç»Çµ","Ç‚ÇËÇ‹Ç∑ÇÀÇ•"},
         {"Ç»Çµ","Ç”ÇüÇ¡Ç´Ç„","Ç»Çµ"},
         {"Ç»Çµ","Ç»Çµ","ÉRÅ™ÉRÅ´"},
         {"Ç»Çµ","Ç»Çµ","Ç»Çµ"},
         {"Ç»Çµ","Ç»Çµ","Ç»Çµ"},
         {"Ç»Çµ","Ç»Çµ","Ç»Çµ"},
         {"Ç»Çµ","Ç»Çµ","Ç»Çµ"},
         {"Ç»Çµ","Ç»Çµ","Ç»Çµ"},
         {"Ç»Çµ","Ç»Çµ","Ç»Çµ"},
         {"Ç»Çµ","Ç»Çµ","Ç»Çµ"}
};

int _charData[10][static_cast<int>(Data::MAX)] =
{
     {100,    150,    200,     100 },
     {442,    43,    2,     300 },
     {23,    32,    523,     200 },
     {2432,    11,    23,     500 },
     {42,    32,    53,     300 },
     {43,    42,    3,     600 },
     {43,    42,    23,     200 },
     {243,    234,    35,     900 },
     {243,    42,    90,     800 },
     {432,    24,    500,     600 }
};

int _goodSk[10] = {0,0,1,1,2,1,2,0,2, 1 };
