#include "CharData.h"

std::string _skName[10][3] =
{
         {"はがいじめ","ずつき","けたぐり"},
         {"ねこぱんち！！","ひっかき","クナイ"},
         {"きりさき","みねうち","刺突"},
         {"カノン","クレッシェンド","フォルテシモ"},
         {"トナカイさん","メリークリスマス！","プレゼントだよ"},
         {"Go To Hell","ウィンド","フェザーシュート"},
         {"生徒会権限だ","手段は選ばない","ここまでだ"},
         {"まぁおちつけって","ちょ、ちょっとタンマ!!","おいたはここまでだぜ"},
         {"胴っ！！","小手ぇ！！","面っ！！"},
         {"ぐるるぅ","がおー","がおがおー"}
};

int _charData[10][static_cast<int>(charData::MAX)] =
{
     {3000,    300,    400,     300 },
     {2700,    400,    450,     450 },
     {3200,    250,    100,     450 },
     {3500,    100,    250,     150 },
     {2650,    300,    550,     500 },
     {2900,    500,    200,     400 },
     {2500,    500,    500,     500 },
     {3000,    200,    0,     800 },
     {2800,    400,    400,     400 },
     {2200,    600,    600,     600 }
};

int _goodSk[10] = {1,0,2,1,0,2,0,2,1, 1 };
